'''
# 딕셔너리

딕셔너리: 복합자료형 3남매 중 둘째. 기억력이 좋고 유연하며, 개성이 있다. 
- 3남매의 인생 고민: 묶어둔 데이터를 어떻게 구분할 것인가? == 자료를 어떻게 넣어두고 어떻게 꺼내어 쓸 것인가?
- 리스트, 튜플: 순서대로, 정수 인덱스를 사용해서
- 딕셔너리: 순서가 아닌, 자료(value)에 특정한 의미(key)를 붙여서. key-value pairs
- mutable. 추가, 수정, 삭제 가능

생성하기
- {} 로 생성
{ key1: value1, key2: value2, ... }
{ 
    key1: value1,
    key2: value2,
    ...
}
- key: 기본 자료형(문자열, 숫자) 올 수 있음
- value: 아무거나 다 됨

접근, 수정, 삭제는 실습을 통해서

'''

# 1. 딕셔너리 생성, 값 접근
## 빈 딕셔너리
empty_dict = {}
## 자신의 핸드폰 정보를 담은 딕셔너리를 만들어보자
my_phone = {}



# 2. 추가, 수정, 삭제
